src/Documents/ИС_АЛИ_Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИС_АЛИ_Заказ</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>buyer_country_code</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>buyer_name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>buyer_phone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>total_amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>delivery_address</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>order_lines</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>id</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>30</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>item_id</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>product_source_id</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>30</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>sku_id</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>sku_code</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>total_amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>item_price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>buyer_comment</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>discount_currency</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>original_discount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураАли</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_АЛИ_Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариацияАли</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_АЛИ_Вариации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>pre_split_postings</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>id</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>30</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>num_id</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>order_line_id</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>item_id</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>sku_id</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>product_source_id</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>item_price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураАли</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_АЛИ_Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариацияАли</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_АЛИ_Вариации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>logistics_type</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>height</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>weight</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>width</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>length</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ИС_АЛИ_СоответствиеХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_АЛИ_СоответствиеХарактеристик</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариацияАЛИ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_АЛИ_Вариации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/ИС_АЛИ_Заказ/Forms/ФормаКиЗов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Стояк Ю.К. 14.06.2024 УА #62573
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если Параметры.Свойство("Профиль") Тогда
		Профиль = Параметры.Профиль;
	Иначе
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Не выбран Профиль");
	КонецЕсли; 
	
	Если Параметры.Свойство("СборочныеЗадания") Тогда
		ЗаполнитьТаблицуВыгрузки(Профиль, Параметры.СборочныеЗадания);
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Нет данных для выгрузки КиЗов");
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 14.06.2024 УА #62573 

#КонецОбласти

#Область ОбработчикиКомандФормы 

//+ ИнфоСофт Стояк Ю.К. 14.06.2024 УА #62573
&НаКлиенте
Процедура ВыгрузитьКиЗы(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	Если ДанныеКВыгрузке.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нет данных для выгрузки");
		Возврат;
	КонецЕсли;
	
	НеЗаполненКиз = Ложь;
	
	Для Каждого Строка Из ДанныеКВыгрузке Цикл
		
		Если Не ЗначениеЗаполнено(Строка.КодМаркировки) Тогда
			НеЗаполненКиз = Истина;  
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НеЗаполненКиз Тогда
		
		Оповещение = Новый ОписаниеОповещения("ВыгрузитьКиЗыЗавершение", ЭтотОбъект, Параметры);
		СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(Оповещение, 
		НСтр("ru = 'В выгружаемых данных КиЗ должен быть заполнен. Уверены что хотите выгрузить КиЗы?'"), 
		РежимДиалогаВопрос.ДаНет);
		
	Иначе
		ВыгрузитьКиЗыНаСервере();
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 14.06.2024 УА #62573

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

//+ ИнфоСофт Стояк Ю.К. 14.06.2024 УА #62573
&НаСервере
Процедура ЗаполнитьТаблицуВыгрузки(Профиль, МассивЗаказов)
	
	
	МассивID = Новый Массив;
	
	Для Каждого Заказ Из МассивЗаказов Цикл
		МассивID.Добавить(Заказ.Номер);
	КонецЦикла;	
	
	МассивОтправлений = ИС_АЛИ_Сервер.ПолучитьСписокОтправлений(Профиль, МассивID);
	
 	Если МассивОтправлений.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Данных по отправлениям нет.");
		Возврат;
	КонецЕсли;
	
	ТЗ_Заказы = Новый ТаблицаЗначений;
	
	ТЗ_Заказы.Колонки.Добавить("Номер");
	ТЗ_Заказы.Колонки.Добавить("НомерОтправления");
	ТЗ_Заказы.Колонки.Добавить("Заказ1С");
	ТЗ_Заказы.Колонки.Добавить("РеализацияТоваровУслуг");
	ТЗ_Заказы.Колонки.Добавить("Номенклатура");
	ТЗ_Заказы.Колонки.Добавить("Характеристика");
	ТЗ_Заказы.Колонки.Добавить("НомерСтр");
	ТЗ_Заказы.Колонки.Добавить("sku_id");
	ТЗ_Заказы.Колонки.Добавить("quantity");
	ТЗ_Заказы.Колонки.Добавить("КодМаркировки");
	ТЗ_Заказы.Колонки.Добавить("ИднексАртикула");
	
	НомерСтр = 1;
	ИднексАртикула = 0;
	
	ТекНоменклатура = Неопределено;
	ТекХарактеристика = Неопределено;
	ТекРеализацияТоваровУслуг = Неопределено;
	ТекНомер = Неопределено;
	ТекАртикул = Неопределено;
	
	ЗапросРТУ = Новый Запрос;
	
	//+ ИнфоСофт Заварин К.В. 03.02.25 УА #92764
	//+ ИнфоСофт Ивонин К.А. 04.02.25 УА #92887
	//Если ИС_MP_Сервер.ПолучитьВерсиюБезРедакции() >= "5.19.44" Тогда
	ВерсияБезРедации = ИС_МП_Сервер.ВерсияБезРедакции();
	
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(ВерсияБезРедации, "5.19.44") >= 0 Тогда
	//- ИнфоСофт Ивонин К.А. 04.02.25 УА #92887
		
		ЗапросРТУ.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ВТ_ДанныеОтправлений.logistic_order_id КАК ЧИСЛО(30, 0)) КАК НомерОтправления,
		|	ВЫРАЗИТЬ(ВТ_ДанныеОтправлений.trade_order_id КАК ЧИСЛО(30, 0)) КАК НомерЗаказа,
		|	ВТ_ДанныеОтправлений.quantity КАК quantity,
		|	ВТ_ДанныеОтправлений.sku_id КАК sku_id
		|ПОМЕСТИТЬ ВТ_ДанныеОтправлений
		|ИЗ
		|	&ВТ_ДанныеОтправлений КАК ВТ_ДанныеОтправлений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИС_АЛИ_Заказ.Заказ КАК Заказ,
		|	ИС_АЛИ_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
		|	ИС_АЛИ_СоответствиеХарактеристик.Характеристика КАК Характеристика,
		|	ВТ_ДанныеОтправлений.НомерОтправления КАК НомерОтправления,
		|	ВТ_ДанныеОтправлений.НомерЗаказа КАК Номер,
		|	ВТ_ДанныеОтправлений.quantity КАК quantity,
		|	ВТ_ДанныеОтправлений.sku_id КАК sku_id
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	ВТ_ДанныеОтправлений КАК ВТ_ДанныеОтправлений
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИС_АЛИ_Заказ КАК ИС_АЛИ_Заказ
		|		ПО ВТ_ДанныеОтправлений.НомерЗаказа = ИС_АЛИ_Заказ.Номер
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_АЛИ_СоответствиеХарактеристик КАК ИС_АЛИ_СоответствиеХарактеристик
		|		ПО ВТ_ДанныеОтправлений.sku_id = ИС_АЛИ_СоответствиеХарактеристик.ВариацияАЛИ.sku_id
		|ГДЕ
		|	ИС_АЛИ_Заказ.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|	И ИС_АЛИ_СоответствиеХарактеристик.Номенклатура.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Ссылка КАК РеализацияТоваровУслуг,
		|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
		|	ВТ_Номенклатура.Характеристика КАК Характеристика,
		|	ВТ_Номенклатура.Заказ КАК Заказ,
		|	ВТ_Номенклатура.Номер КАК Номер,
		|	ВТ_Номенклатура.quantity КАК Количество,
		|	ВТ_Номенклатура.sku_id КАК sku_id,
		|	ВТ_Номенклатура.НомерОтправления КАК НомерОтправления
		|ПОМЕСТИТЬ ВТ_РТУ
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ПО ВТ_Номенклатура.Заказ = РеализацияТоваровУслугТовары.ЗаказКлиента
		|			И ВТ_Номенклатура.Номенклатура = РеализацияТоваровУслугТовары.Номенклатура
		|			И ВТ_Номенклатура.Характеристика = РеализацияТоваровУслугТовары.Характеристика
		|ГДЕ
		|	НЕ РеализацияТоваровУслугТовары.Ссылка ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслугТовары.Ссылка,
		|	ВТ_Номенклатура.Номенклатура,
		|	ВТ_Номенклатура.Характеристика,
		|	ВТ_Номенклатура.Заказ,
		|	ВТ_Номенклатура.Номер,
		|	ВТ_Номенклатура.quantity,
		|	ВТ_Номенклатура.sku_id,
		|	ВТ_Номенклатура.НомерОтправления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПередачаТоваровХранителюТовары.Ссылка,
		|	ВТ_Номенклатура.Номенклатура,
		|	ВТ_Номенклатура.Характеристика,
		|	ВТ_Номенклатура.Заказ,
		|	ВТ_Номенклатура.Номер,
		|	ВТ_Номенклатура.quantity,
		|	ВТ_Номенклатура.sku_id,
		|	ВТ_Номенклатура.НомерОтправления
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ПередачаТоваровХранителюТовары
		|		ПО ВТ_Номенклатура.Заказ = ПередачаТоваровХранителюТовары.ЗаказКлиента
		|			И ВТ_Номенклатура.Номенклатура = ПередачаТоваровХранителюТовары.Номенклатура
		|			И ВТ_Номенклатура.Характеристика = ПередачаТоваровХранителюТовары.Характеристика
		|ГДЕ
		|	НЕ ПередачаТоваровХранителюТовары.Ссылка ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ПередачаТоваровХранителюТовары.Ссылка,
		|	ВТ_Номенклатура.Номенклатура,
		|	ВТ_Номенклатура.Характеристика,
		|	ВТ_Номенклатура.Заказ,
		|	ВТ_Номенклатура.Номер,
		|	ВТ_Номенклатура.quantity,
		|	ВТ_Номенклатура.sku_id,
		|	ВТ_Номенклатура.НомерОтправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РТУ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг,
		|	ВТ_РТУ.Номенклатура КАК Номенклатура,
		|	ВТ_РТУ.Характеристика КАК Характеристика,
		|	ВТ_РТУ.Заказ КАК Заказ,
		|	ВТ_РТУ.Номер КАК Номер,
		|	ВТ_РТУ.Количество КАК Количество,
		|	ВТ_РТУ.sku_id КАК sku_id,
		|	ВТ_РТУ.НомерОтправления КАК НомерОтправления
		|ИЗ
		|	ВТ_РТУ КАК ВТ_РТУ
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеализацияТоваровУслуг,
		|	Номенклатура,
		|	Характеристика";
	Иначе
		ЗапросРТУ.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ВТ_ДанныеОтправлений.logistic_order_id КАК ЧИСЛО(30,0)) КАК НомерОтправления,
		|	ВЫРАЗИТЬ(ВТ_ДанныеОтправлений.trade_order_id КАК ЧИСЛО(30,0)) КАК НомерЗаказа,
		|	ВТ_ДанныеОтправлений.quantity КАК quantity,
		|	ВТ_ДанныеОтправлений.sku_id КАК sku_id
		|ПОМЕСТИТЬ ВТ_ДанныеОтправлений
		|ИЗ
		|	&ВТ_ДанныеОтправлений КАК ВТ_ДанныеОтправлений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИС_АЛИ_Заказ.Заказ КАК Заказ,
		|	ИС_АЛИ_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
		|	ИС_АЛИ_СоответствиеХарактеристик.Характеристика КАК Характеристика,
		|	ВТ_ДанныеОтправлений.НомерОтправления КАК НомерОтправления,
		|	ВТ_ДанныеОтправлений.НомерЗаказа КАК Номер,
		|	ВТ_ДанныеОтправлений.quantity КАК quantity,
		|	ВТ_ДанныеОтправлений.sku_id КАК sku_id
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	ВТ_ДанныеОтправлений КАК ВТ_ДанныеОтправлений
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИС_АЛИ_Заказ КАК ИС_АЛИ_Заказ
		|		ПО ВТ_ДанныеОтправлений.НомерЗаказа = ИС_АЛИ_Заказ.Номер
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_АЛИ_СоответствиеХарактеристик КАК ИС_АЛИ_СоответствиеХарактеристик
		|		ПО ВТ_ДанныеОтправлений.sku_id = ИС_АЛИ_СоответствиеХарактеристик.ВариацияАЛИ.sku_id
		|ГДЕ
		|	ИС_АЛИ_Заказ.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|	И ИС_АЛИ_СоответствиеХарактеристик.Номенклатура.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Ссылка КАК РеализацияТоваровУслуг,
		|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
		|	ВТ_Номенклатура.Характеристика КАК Характеристика,
		|	ВТ_Номенклатура.Заказ КАК Заказ,
		|	ВТ_Номенклатура.Номер КАК Номер,
		|	ВТ_Номенклатура.quantity КАК Количество,
		|	ВТ_Номенклатура.sku_id КАК sku_id,
		|	ВТ_Номенклатура.НомерОтправления КАК НомерОтправления
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ПО ВТ_Номенклатура.Заказ = РеализацияТоваровУслугТовары.ЗаказКлиента
		|			И ВТ_Номенклатура.Номенклатура = РеализацияТоваровУслугТовары.Номенклатура
		|			И ВТ_Номенклатура.Характеристика = РеализацияТоваровУслугТовары.Характеристика
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслугТовары.Ссылка,
		|	ВТ_Номенклатура.Номенклатура,
		|	ВТ_Номенклатура.Характеристика,
		|	ВТ_Номенклатура.Заказ,
		|	ВТ_Номенклатура.Номер,
		|	ВТ_Номенклатура.quantity,
		|	ВТ_Номенклатура.sku_id,
		|	ВТ_Номенклатура.НомерОтправления
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеализацияТоваровУслуг,
		|	Номенклатура,
		|	Характеристика";	
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 03.02.25 УА #92764
	
	ЗапросРТУ.УстановитьПараметр("ВТ_ДанныеОтправлений", МассивОтправлений);
	
	РезультатЗапросаКоды = ЗапросРТУ.Выполнить();
	
	ВыборкаРТУ = РезультатЗапросаКоды.Выбрать(); 
		
	Пока ВыборкаРТУ.Следующий() Цикл
		
		Для Счетчик = 1 По ВыборкаРТУ.Количество Цикл 
			
			Если ВыборкаРТУ.РеализацияТоваровУслуг = ТекРеализацияТоваровУслуг И ВыборкаРТУ.Номенклатура = ТекНоменклатура И ВыборкаРТУ.Характеристика = ТекХарактеристика Тогда				
				НомерСтр = НомерСтр + 1;	
			Иначе	
				НомерСтр = 1;		
			КонецЕсли; 
			
			Если ВыборкаРТУ.НомерОтправления = ТекНомер И ВыборкаРТУ.sku_id = ТекАртикул Тогда				
				ИднексАртикула = ИднексАртикула + 1;	
			Иначе	
				ИднексАртикула = 0;		
			КонецЕсли;
			
			НоваяСтрока 					= ТЗ_Заказы.Добавить();
			НоваяСтрока.НомерСтр			= НомерСтр;
			НоваяСтрока.НомерОтправления 	= ВыборкаРТУ.НомерОтправления;
			НоваяСтрока.Номер 				= ВыборкаРТУ.Номер;
			НоваяСтрока.Заказ1С 			= ВыборкаРТУ.Заказ;
			НоваяСтрока.ИднексАртикула 		= ИднексАртикула;
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРТУ, "РеализацияТоваровУслуг,sku_id,Номенклатура,Характеристика");
			
			ТекНоменклатура = НоваяСтрока.Номенклатура;
			ТекХарактеристика = НоваяСтрока.Характеристика;
			ТекРеализацияТоваровУслуг = НоваяСтрока.РеализацияТоваровУслуг;
			ТекНомер = НоваяСтрока.НомерОтправления;
			ТекАртикул = НоваяСтрока.sku_id;
			
		КонецЦикла;
		
	КонецЦикла; 	
	
	РасходныеНакладные = Новый Массив;	
	РасходныеНакладные = ТЗ_Заказы.ВыгрузитьКолонку("РеализацияТоваровУслуг");
	
	Если РасходныеНакладные.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Получение Реализаций по данным заказов завершилось с ошибкой");
	КонецЕсли;
	
	РасходныеНакладные = ОбщегоНазначенияКлиентСервер.СвернутьМассив(РасходныеНакладные);	
	
	ЗапросКоды = Новый Запрос; 
		
	//+ ИнфоСофт Заварин К.В. 03.02.25 УА #92764
	//+ ИнфоСофт Ивонин К.А. 04.02.25 УА #92887
	//Если ИС_MP_Сервер.ПолучитьВерсиюБезРедакции() >= "5.19.44" Тогда
	ВерсияБезРедации = ИС_МП_Сервер.ВерсияБезРедакции();
	
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(ВерсияБезРедации, "5.19.44") >= 0 Тогда
	//- ИнфоСофт Ивонин К.А. 04.02.25 УА #92887
		
		ЗапросКоды.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугШтрихкодыУпаковок.Ссылка КАК РеализацияТоваровУслуг,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.Номенклатура КАК Номенклатура,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВТ_ШтрихкодУпаковкиРТУ
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.ШтрихкодыУпаковок КАК РеализацияТоваровУслугШтрихкодыУпаковок
		|ГДЕ
		|	РеализацияТоваровУслугШтрихкодыУпаковок.Ссылка В(&МассивРТУ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПередачаТоваровХранителюШтрихкодыУпаковок.Ссылка,
		|	ПередачаТоваровХранителюШтрихкодыУпаковок.ШтрихкодУпаковки,
		|	ПередачаТоваровХранителюШтрихкодыУпаковок.ШтрихкодУпаковки.ЗначениеШтрихкода,
		|	ПередачаТоваровХранителюШтрихкодыУпаковок.ШтрихкодУпаковки.Номенклатура,
		|	ПередачаТоваровХранителюШтрихкодыУпаковок.ШтрихкодУпаковки.Характеристика
		|ИЗ
		|	Документ.ПередачаТоваровХранителю.ШтрихкодыУпаковок КАК ПередачаТоваровХранителюШтрихкодыУпаковок
		|ГДЕ
		|	ПередачаТоваровХранителюШтрихкодыУпаковок.Ссылка В(&МассивРТУ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ШтрихкодУпаковкиРТУ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг,
		|	ВТ_ШтрихкодУпаковкиРТУ.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
		|	ВТ_ШтрихкодУпаковкиРТУ.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
		|	ВТ_ШтрихкодУпаковкиРТУ.Номенклатура КАК Номенклатура,
		|	ВТ_ШтрихкодУпаковкиРТУ.Характеристика КАК Характеристика
		|ИЗ
		|	ВТ_ШтрихкодУпаковкиРТУ КАК ВТ_ШтрихкодУпаковкиРТУ
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеализацияТоваровУслуг,
		|	Номенклатура,
		|	Характеристика";
		
	Иначе
		
		ЗапросКоды.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугШтрихкодыУпаковок.Ссылка КАК РеализацияТоваровУслуг,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.Номенклатура КАК Номенклатура,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.Характеристика КАК Характеристика
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.ШтрихкодыУпаковок КАК РеализацияТоваровУслугШтрихкодыУпаковок
		|ГДЕ
		|	РеализацияТоваровУслугШтрихкодыУпаковок.Ссылка В(&МассивРТУ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеализацияТоваровУслуг,
		|	Номенклатура,
		|	Характеристика";
		
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 03.02.25 УА #92764
	
	ЗапросКоды.УстановитьПараметр("МассивРТУ", РасходныеНакладные);
	
	РезультатЗапросаКизы = ЗапросКоды.Выполнить();
	
	Выборка_Кизы = РезультатЗапросаКизы.Выбрать();
	
	НомерСтр = 1;
	
	ТекНоменклатура = Неопределено;
	ТекХарактеристика = Неопределено;
	ТекРеализацияТоваровУслуг = Неопределено;
	
	ТЗ_Кизы = Новый ТаблицаЗначений;
	ТЗ_Кизы.Колонки.Добавить("НомерСтр"); 
	ТЗ_Кизы.Колонки.Добавить("РеализацияТоваровУслуг");
	ТЗ_Кизы.Колонки.Добавить("ШтрихкодУпаковки");
	ТЗ_Кизы.Колонки.Добавить("ЗначениеШтрихкода");
	ТЗ_Кизы.Колонки.Добавить("Номенклатура");
	ТЗ_Кизы.Колонки.Добавить("Характеристика");
	
	Пока Выборка_Кизы.Следующий() Цикл
		
		Если Выборка_Кизы.РеализацияТоваровУслуг = ТекРеализацияТоваровУслуг И Выборка_Кизы.Номенклатура = ТекНоменклатура И Выборка_Кизы.Характеристика = ТекХарактеристика Тогда				
			НомерСтр = НомерСтр + 1;	
		Иначе	
			НомерСтр = 1;		
		КонецЕсли;
		
		НоваяСтрока = ТЗ_Кизы.Добавить();	
		НоваяСтрока.НомерСтр = НомерСтр;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка_Кизы);
		
		ТекНоменклатура = НоваяСтрока.Номенклатура;
		ТекХарактеристика = НоваяСтрока.Характеристика;
		ТекРеализацияТоваровУслуг = НоваяСтрока.РеализацияТоваровУслуг;
		
	КонецЦикла;	
	
	Для Каждого Строка Из ТЗ_Заказы Цикл 
		
		Отбор = Новый Структура(); 
		
		Отбор.Вставить("НомерСтр", Строка.НомерСтр);
		Отбор.Вставить("Номенклатура", Строка.Номенклатура);
		Отбор.Вставить("Характеристика", Строка.Характеристика);
		
		МассивКизов = ТЗ_КиЗы.НайтиСтроки(Отбор);
		
		Если МассивКизов.Количество() = 0 Тогда
			Продолжить;	
		КонецЕсли;
		
		Для Каждого Элемент Из МассивКизов Цикл 
			
			Строка.КодМаркировки = Элемент.ЗначениеШтрихкода;
			Строка.ШтрихкодУпаковки = Элемент.ШтрихкодУпаковки;
			ТЗ_КиЗы.Удалить(Элемент);
			Прервать;
			
		КонецЦикла;	
		
	КонецЦикла;
		
	Для Каждого Строка Из ТЗ_Заказы Цикл 
		
		НоваяСтрока = ДанныеКВыгрузке.Добавить();		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "ИднексАртикула,НомерОтправления,Номенклатура,Характеристика,КодМаркировки,sku_id,Номер,НомерСтр");
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 14.06.2024 УА #62573

//+ ИнфоСофт Стояк Ю.К. 14.06.2024 УА #62573
&НаСервере
Процедура ВыгрузитьКиЗыНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ_ДанныеПоКизам.sku_id КАК sku_id,
	|	ВТ_ДанныеПоКизам.НомерСтр КАК НомерСтр,
	|	ВТ_ДанныеПоКизам.НомерОтправления КАК НомерОтправления,
	|	ВТ_ДанныеПоКизам.КодМаркировки КАК КодМаркировки
	|ПОМЕСТИТЬ ВТ_ДанныеКиЗов
	|ИЗ
	|	&ВТ_ДанныеПоКизам КАК ВТ_ДанныеПоКизам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеКиЗов.sku_id КАК sku_id,
	|	ВТ_ДанныеКиЗов.НомерСтр КАК НомерСтр,
	|	ВТ_ДанныеКиЗов.НомерОтправления КАК НомерОтправления,
	|	ВТ_ДанныеКиЗов.КодМаркировки КАК КодМаркировки
	|ИЗ
	|	ВТ_ДанныеКиЗов КАК ВТ_ДанныеКиЗов
	|ИТОГИ ПО
	|	НомерОтправления,
	|	sku_id";
	
	Запрос.УстановитьПараметр("ВТ_ДанныеПоКизам", ДанныеКВыгрузке.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНомерОтправления = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНомерОтправления.Следующий() Цикл
	
		ВыборкаSkuId = ВыборкаНомерОтправления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		МассивProducts = Новый Массив;

		Пока ВыборкаSkuId.Следующий() Цикл
			
			СтруктураProducts = Новый Структура;
			
			ВыборкаКиЗов = ВыборкаSkuId.Выбрать();   	 
			
			МассивЭкземпляров = Новый Массив;
			
			Пока ВыборкаКиЗов.Следующий() Цикл
				
				СтруктураЭкземпляров = Новый Структура;
				
				СтруктураЭкземпляров.Вставить("sku_index", 		ВыборкаКиЗов.ИднексАртикула);
				СтруктураЭкземпляров.Вставить("value_sign",		ВыборкаКиЗов.КодМаркировки);
				СтруктураЭкземпляров.Вставить("sku_id", 		ВыборкаКиЗов.sku_id);
				
				МассивЭкземпляров.Добавить(СтруктураЭкземпляров);	
				
			КонецЦикла;                                           
			
			СтруктураЭкземпляров.Вставить("sku_index", 		ВыборкаКиЗов.ИднексАртикула);
			СтруктураЭкземпляров.Вставить("value_sign",		ВыборкаКиЗов.КодМаркировки);
			СтруктураЭкземпляров.Вставить("sku_id", 		ВыборкаКиЗов.sku_id);
			
			МассивProducts.Добавить(СтруктураProducts);
			
		КонецЦикла;
		
		СтруктураДанных = Новый Структура;
			
		СтруктураДанных.Вставить("items", 				МассивProducts);
		СтруктураДанных.Вставить("logistic_order_id", 	ВыборкаНомерОтправления.НомерОтправления);
		
		Результат = ИС_АЛИ_Сервер.ВыгрузитьКиЗ(Профиль, СтруктураДанных);
		
		Если Результат = Неопределено Тогда
			Продолжить;
		Иначе
			
			Отбор = Новый Структура("НомерОтправления", ВыборкаНомерОтправления.НомерОтправления);
			НайденныеСтроки = ДанныеКВыгрузке.НайтиСтроки(Отбор);
			
			Для Каждого Строка Из НайденныеСтроки Цикл
				Строка.Выгружен = Истина;
			КонецЦикла;
				
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 14.06.2024 УА #62573

//+ ИнфоСофт Стояк Ю.К. 14.06.2024 УА #62573
&НаКлиенте
Процедура ВыгрузитьКиЗыЗавершение(Результат, Параметры) Экспорт
	
	Если Результат.Значение = КодВозвратаДиалога.Да Тогда 
		ВыгрузитьКиЗыНаСервере();
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выгрузка КиЗов отменена!");
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 14.06.2024 УА #62573 

#КонецОбласти
